Revit 2024 API
BaseExportOptions.HideReferencePlane Property
 Whether or not to hide reference planes. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HideReferencePlane { get; set; }
Visual Basic
Public Property HideReferencePlane As Boolean
	Get
	Set
Visual C++
public:
property bool HideReferencePlane {
	bool get ();
	void set (bool value);
}
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace